print('Lets go!')
'''
https://www.youtube.com/watch?v=5g-MHZ0MzZY
Python — высокоуровневый язык программирования общего назначения с динамической строгой типизацией и 
автоматическим управлением памятью, ориентированный на повышение производительности разработчика, читаемости кода и 
его качества, а также на обеспечение переносимости написанных на нём программ.
Высокоуровневый язык программирования – средство записи компьютерных программ, обеспечивающее высокую скорость и 
удобство работы. Его отличительной чертой является абстракция.
Абстракция — процесс отвлечения от тех или иных характеристик объекта для их избирательного анализа; 
при этом наблюдаемый объект замещается его идеализированным теоретическим образом – абстрактным объектом.
Динамическая типизация — приём,используемый в языках программирования и языках спецификации, при котором переменная 
связывается с типом в момент присваивания значения, а не в момент объявления переменной. Таким образом, в различных 
участках программы одна и та же переменная может принимать значения разных типов. 
'''
