x = float(input('Введите число '))
y = float(input('Введите число '))

#r = int(x) + 5 переводит из строки в целочисленное значение
#r = float(x) + 5 переводит в число с плавающей точкой
#Так же могут конвертировать друг в друга
r = x + y
print('Результат ' + str(r))

'''
input - является одним из разносторонних элементов формы и позволяет создавать разные элементы интерфейса и 
обеспечить взаимодействие с пользователем. Главным образом <input> предназначен для создания текстовых полей, различных 
кнопок, переключателей и флажков 
int - Возвращает целую часть числа. Значение для проверки (обычно в ячейке) 
float - это свойство CSS для позиционирования элементов. Для того чтобы понять его назначение и происхождение, можно 
обратиться к полиграфическому дизайну. В компоновке при печати, изображения могут располагаться на странице так, 
чтобы текст "обтекал" их. Обычно это так и называется: "обтекание текстом"
Переменная типа int (short, long) позволяет хранить только целые значения, тогда как переменная типа float (double) 
хранит в себе десятичные значения.
str - преобразует данные в строку. Для любого типа данных можно получить строковое представление.
'''
