"""
https://www.youtube.com/watch?v=-Zdu4ntX_DU&list=PLNi5HdK6QEmX9fxp3_IBFx1O5tiTmKlYm
Объект - единица информации в памяти
Экземпляр - конкретный объект
Класс - инструкция по созданию объектов определенного типа
Метод - функция в классе для воздействия на объект
Поля или свойства - переменные в классе
Атрибуты - все имена в классе: переменных и методов
ООП строится вокруг четырёх основных принципов: абстракция, инкапсуляция, наследование и полиморфизм
"""
from tkinter import Tk
x = [7, 8, 5]
print(x)

y = [8, 9]
print(y)

root = Tk()
root.mainloop()
