x = -3

if x == 0:
    print('if')
elif x > 0:
    print('elif')
else:
    print('else')

'''
Условная инструкция if-elif-else (её ещё иногда называют оператором ветвления) - основной инструмент выбора в Python.
Проще говоря, она выбирает, какое действие следует выполнить, в зависимости от значения переменных в момент проверки
условия.
if - Оператор if служит для того, чтобы выполнить какую-либо операцию в том случае, когда условие является верным.
elif - Блок elif это тот же if, но только следующая проверка
else - If-then-else — это условные конструкции в языках программирования: если (if) что-то истинно, тогда (then)
выполнить одно действие, иначе (else) выполнить другое действие.
В Python, как и в других языках, есть логический тип переменных bool, который имеет всего два значения:
True (истина) и False (ложь). Его возвращают логические операторы (например сравнение чисел или проверка присутствия 
элемента в списке), и именно этот тип обычно используется в if и while.
!= - не равно ли
'''
